create table todolist (
  id   int(11) primary key auto_increment, 
  name  varchar(45),
  wtd   varchar(100),
  category  varchar(45),
  didit tinyint(1),
  date  timestamp(6));
  
insert into todolist values('1','ДР Друга1','Надо поздравить','Праздник', '1', '2015-01-11 00:00:00.000000');
insert into todolist values('2','ДР Друга2','Надо поздравить','Праздник', '1', '2015-02-15 00:00:00.000000');
insert into todolist values('3','ДР Друга3','Надо поздравить','Праздник', '1', '2015-03-20 00:00:00.000000');
insert into todolist values('4','ДР Друга4','Надо поздравить','Праздник', '0', '2015-04-13 00:00:00.000000');
insert into todolist values('5','ДР Друга5','Надо поздравить','Праздник', '0', '2015-05-30 00:00:00.000000');
insert into todolist values('6','ДР Друга6','Надо поздравить','Праздник', '0', '2015-06-17 00:00:00.000000');
insert into todolist values('7','ДР Друга7','Надо поздравить','Праздник', '0', '2015-07-21 00:00:00.000000');
insert into todolist values('8','Прибраться','Всё убрать','Домашние дела', '1', '2015-03-31 00:00:00.000000');
insert into todolist values('9','Прибраться','Всё убрать','Домашние дела', '1', '2015-04-01 00:00:00.000000');
insert into todolist values('10','Прибраться','Всё убрать','Домашние дела', '0', '2015-04-05 00:00:00.000000');
insert into todolist values('11','Прибраться','Всё убрать','Домашние дела', '0', '2015-04-06 00:00:00.000000');
insert into todolist values('12','Прибраться','Всё убрать','Домашние дела', '0', '2015-04-07 00:00:00.000000');
insert into todolist values('13','Прибраться','Всё убрать','Домашние дела', '0', '2015-04-08 00:00:00.000000');
insert into todolist values('14','Прибраться','Всё убрать','Домашние дела', '0', '2015-04-09 00:00:00.000000');
insert into todolist values('15','Приготовить еду','Приготовить вкусную еду','Домашние дела', '1', '2015-03-31 00:00:00.000000');
insert into todolist values('16','Приготовить еду','Приготовить вкусную еду','Домашние дела', '0', '2015-04-20 00:00:00.000000');
insert into todolist values('17','Приготовить еду','Приготовить вкусную еду','Домашние дела', '0', '2015-04-22 00:00:00.000000');
insert into todolist values('18','Приготовить еду','Приготовить вкусную еду','Домашние дела', '0', '2015-05-30 00:00:00.000000');
insert into todolist values('19','Приготовить еду','Приготовить вкусную еду','Домашние дела', '0', '2015-07-01 00:00:00.000000');
insert into todolist values('20','Приготовить еду','Приготовить вкусную еду','Домашние дела', '0', '2015-01-02 00:00:00.000000');
insert into todolist values('21','Приготовить еду','Приготовить вкусную еду','Домашние дела', '1', '1995-02-03 00:00:00.000000');
insert into todolist values('22','Сходить развлечься','Хорошо отдохнуть','Отдых', '0', '2016-03-20 00:00:00.000000');
insert into todolist values('23','Сходить развлечься','Хорошо отдохнуть','Отдых', '1', '2015-03-26 00:00:00.000000');
insert into todolist values('24','Сходить развлечься','Хорошо отдохнуть','Отдых', '1', '2014-04-20 00:00:00.000000');
insert into todolist values('25','Сходить развлечься','Хорошо отдохнуть','Отдых', '1', '2013-05-17 00:00:00.000000');
insert into todolist values('26','Сходить развлечься','Хорошо отдохнуть','Отдых', '0', '2015-08-15 00:00:00.000000');
insert into todolist values('27','Сходить развлечься','Хорошо отдохнуть','Отдых', '0', '2015-12-31 00:00:00.000000');
insert into todolist values('28','Сходить развлечься','Хорошо отдохнуть','Отдых', '0', '2015-10-13 00:00:00.000000');